%计算LSF帧间、帧内预测残差
load('../trainData/lsf_all.mat'); %lsf_all
lsf_mean = [0.1897,0.3640,0.6313,0.9681,1.2868,1.6050,1.9230,2.2065,2.5305,2.8074];%均值
a = [0,-0.2500,-0.5487,-0.6120,-0.7338,-0.6005,-0.5978,-0.4876,-0.4137,-0.1922];%帧内预测系数
b = [0.7961,0.7675,0.9341,1.0192,1.2519,1.1503,1.2330,1.0183,0.9311,0.7360];%帧间预测系数
w = lsf_all';
N = size(w,1);%总帧数量

%去均值
for n = 1:N
    w(n,:) = w(n,:) - lsf_mean;
end
res = w;
%第一帧，只做帧内预测
for i = 2:10
    res(1,i) = a(i)*w(1,i-1);
end
%向量第一维，只做帧间预测
for n = 2:N
    res(n,1) = b(i)*w(n-1,i);
end
%其他，帧内、帧间预测
for n = 2:N
    for i = 2:10
        res(n,i) = a(i)*w(n,i-1) - b(i)*w(n-1,i);
    end
end
